SiliconLabs/simplicity_sdk/platform/radio/rail_lib/chip/efr32/protocol_config/efr32xg24/ble_efr32xg24_configurator_out.c
const uint32_t ble_LR_DSA_1Mb_0_37_modemConfig[] = {
  0x03014FFCUL, (uint32_t) &phyInfo_4, /* Write: SEQ.PHYINFO */
  0x00014010UL, 0x00004100UL, /* Write: FRC.MAXLENGTH */
  0x0001403CUL, 0x00000000UL, /* Write: FRC.FECCTRL */
  0x00014048UL, 0x03000720UL, /* Write: FRC.CTRL */
  0x00014050UL, 0x00000000UL, /* Write: FRC.TRAILTXDATACTRL */
  0x0001405CUL, 0x00000F0DUL, /* Write: FRC.CONVGENERATOR */
  0x00014108UL, 0x00004CFFUL, /* Write: FRC.FCD0 */
  0x0007C054UL, 0x00301151UL, /* Write: AGC.GAINRANGE */
  /*    C058 */ 0xE60D000EUL, /* AGC.AGCPERIOD0 */
  /*    C05C */ 0x0000002AUL, /* AGC.AGCPERIOD1 */
  /*    C060 */ 0x0D0C0B08UL, /* AGC.HICNTREGION0 */
  /*    C064 */ 0x0000000DUL, /* AGC.HICNTREGION1 */
  /*    C068 */ 0x0002B6D1UL, /* AGC.STEPDWN */
  /*    C06C */ 0x000004E0UL, /* AGC.GAINSTEPLIM0 */
  0x01074040UL, 0x70200000UL, /* Write: MODEM.AFCADJRX */
  /*    4044 */ 0x11A00000UL, /* MODEM.AFCADJTX */
  /*    4048 */ 0x00000010UL, /* MODEM.MIXCTRL */
  /*    404C */ 0x46000000UL, /* MODEM.CTRL0 */
  /*    4050 */ 0x0081C01FUL, /* MODEM.CTRL1 */
  /*    4054 */ 0x20000000UL, /* MODEM.CTRL2 */
  /*    4058 */ 0x00008000UL, /* MODEM.CTRL3 */
  0x01054064UL, 0x00000000UL, /* Write: MODEM.CTRL6 */
  /*    4068 */ 0x00F804B9UL, /* MODEM.TXBR */
  /*    406C */ 0x00000840UL, /* MODEM.RXBR */
  /*    4070 */ 0x00000010UL, /* MODEM.CF */
  /*    4074 */ 0x00040091UL, /* MODEM.PRE */
  0x010F4088UL, 0x001203B7UL, /* Write: MODEM.MODINDEX */
  /*    408C */ 0x60000000UL, /* MODEM.AFC */
  /*    4090 */ 0x00000000UL, /* MODEM.AFCADJLIM */
  /*    4094 */ 0x0D050200UL, /* MODEM.SHAPING0 */
  /*    4098 */ 0x53422F1CUL, /* MODEM.SHAPING1 */
  /*    409C */ 0x60686962UL, /* MODEM.SHAPING2 */
  /*    40A0 */ 0x1F2E4053UL, /* MODEM.SHAPING3 */
  /*    40A4 */ 0x08080A11UL, /* MODEM.SHAPING4 */
  /*    40A8 */ 0x06070808UL, /* MODEM.SHAPING5 */
  /*    40AC */ 0x03030405UL, /* MODEM.SHAPING6 */
  /*    40B0 */ 0x01020202UL, /* MODEM.SHAPING7 */
  /*    40B4 */ 0x01010101UL, /* MODEM.SHAPING8 */
  /*    40B8 */ 0x00000000UL, /* MODEM.SHAPING9 */
  /*    40BC */ 0x00000000UL, /* MODEM.SHAPING10 */
  /*    40C0 */ 0x00000000UL, /* MODEM.SHAPING11 */
  0x0101411CUL, 0x8C2C3000UL, /* Write: MODEM.SRCCHF */
  0x0106413CUL, 0x0051C049UL, /* Write: MODEM.DIGMIXCTRL */
  /*    4140 */ 0x40A05B05UL, /* MODEM.VITERBIDEMOD */
  /*    4144 */ 0x94826E8EUL, /* MODEM.VTCORRCFG0 */
  /*    4148 */ 0x52488221UL, /* MODEM.VTCORRCFG1 */
  /*    414C */ 0x00400809UL, /* MODEM.VTTRACK */
  /*    4150 */ 0x80000DC0UL, /* MODEM.VTBLETIMING */
  0x0101415CUL, 0x0000DDFFUL, /* Write: MODEM.CGCLKSTOP */
  0x01074168UL, 0x3BE8D44CUL, /* Write: MODEM.LONGRANGE */
  /*    416C */ 0x500D1904UL, /* MODEM.LONGRANGE1 */
  /*    4170 */ 0x1A140E08UL, /* MODEM.LONGRANGE2 */
  /*    4174 */ 0x322C2620UL, /* MODEM.LONGRANGE3 */
  /*    4178 */ 0x32103E38UL, /* MODEM.LONGRANGE4 */
  /*    417C */ 0x0A987654UL, /* MODEM.LONGRANGE5 */
  /*    4180 */ 0xB440001DUL, /* MODEM.LONGRANGE6 */
  0x010341D0UL, 0x00000000UL, /* Write: MODEM.TRECPMPATT */
  /*    41D4 */ 0x000000D0UL, /* MODEM.TRECPMDET */
  /*    41D8 */ 0x00120004UL, /* MODEM.TRECSCFG */
  0x011341E0UL, 0x80000000UL, /* Write: MODEM.COCURRMODE */
  /*    41E4 */ 0x2CDDCFE2UL, /* MODEM.CHFCOE00 */
  /*    41E8 */ 0x003AB67EUL, /* MODEM.CHFCOE01 */
  /*    41EC */ 0x00190960UL, /* MODEM.CHFCOE02 */
  /*    41F0 */ 0x00E22251UL, /* MODEM.CHFCOE03 */
  /*    41F4 */ 0x0E51B94CUL, /* MODEM.CHFCOE04 */
  /*    41F8 */ 0x04A98239UL, /* MODEM.CHFCOE05 */
  /*    41FC */ 0x299B22D8UL, /* MODEM.CHFCOE06 */
  /*    4200 */ 0x2CDDCFE2UL, /* MODEM.CHFCOE10 */
  /*    4204 */ 0x003AB67EUL, /* MODEM.CHFCOE11 */
  /*    4208 */ 0x00190960UL, /* MODEM.CHFCOE12 */
  /*    420C */ 0x00E22251UL, /* MODEM.CHFCOE13 */
  /*    4210 */ 0x0E51B94CUL, /* MODEM.CHFCOE14 */
  /*    4214 */ 0x04A98239UL, /* MODEM.CHFCOE15 */
  /*    4218 */ 0x299B22D8UL, /* MODEM.CHFCOE16 */
  /*    421C */ 0x00000000UL, /* MODEM.CHFCTRL */
  /*    4220 */ 0x00000000UL, /* MODEM.CHFLATENCYCTRL */
  /*    4224 */ 0x00000044UL, /* MODEM.FRMSCHTIME */
  /*    4228 */ 0x3C3C3C3CUL, /* MODEM.PREFILTCOEFF */
  0x0101424CUL, 0x04030008UL, /* Write: MODEM.PHDMODCTRL */
  0x01014268UL, 0x00000000UL, /* Write: MODEM.CHFSWCTRL */
  0x01018038UL, 0x001047F1UL, /* Write: SYNTH.IFFREQ */
  0x010280A0UL, 0x00033870UL, /* Write: SYNTH.LPFCTRL1RX */
  /*    80A4 */ 0x000000D0UL, /* SYNTH.LPFCTRL1TX */
  0x110180A8UL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2RX */
  0x310180A8UL, 0x01FD5A05UL, /* OR: SYNTH.LPFCTRL2RX */
  0x110180ACUL, 0x000001F0UL, /* AND: SYNTH.LPFCTRL2TX */
  0x310180ACUL, 0x00FD3E05UL, /* OR: SYNTH.LPFCTRL2TX */
  0x120100ECUL, 0x00000FE0UL, /* AND: RAC.IFADCTRIM0 */
  0x320100ECUL, 0x1151200CUL, /* OR: RAC.IFADCTRIM0 */
  0x02010184UL, 0x00000000UL, /* Write: RAC.SYLOEN */
  0xFFFFFFFFUL,
};

const RAIL_ChannelConfigEntry_t ble_viterbi1M_channels[] = {
  {
    .phyConfigDeltaAdd = ble_viterbi1M_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 37,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi1M_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 38,
    .channelNumberEnd = 38,
    .maxPower = 183,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi1M_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 39,
    .channelNumberEnd = 39,
    .maxPower = 140,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_0,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ble_viterbi2M_channels[] = {
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 37,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 38,
    .channelNumberEnd = 38,
    .maxPower = 160,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 39,
    .channelNumberEnd = 39,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_1,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ble_viterbi2M_aox_channels[] = {
  {
    .phyConfigDeltaAdd = ble_viterbi2M_aox_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 34,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_aox_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 35,
    .channelNumberEnd = 35,
    .maxPower = 182,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_aox_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 36,
    .channelNumberEnd = 36,
    .maxPower = 157,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_aox_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 37,
    .channelNumberEnd = 37,
    .maxPower = 125,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_aox_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 38,
    .channelNumberEnd = 38,
    .maxPower = 83,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_viterbi2M_aox_0_34_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 39,
    .channelNumberEnd = 39,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_0,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_2,
#endif
    .alternatePhy = NULL,
  },
};

const RAIL_ChannelConfigEntry_t ble_LR_DSA_125kb_channels[] = {
  {
    .phyConfigDeltaAdd = ble_LR_DSA_125kb_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 0,
    .channelNumberEnd = 37,
    .maxPower = RAIL_TX_POWER_MAX,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_3,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_LR_DSA_125kb_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 38,
    .channelNumberEnd = 38,
    .maxPower = 183,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_3,
#endif
    .alternatePhy = NULL,
  },
  {
    .phyConfigDeltaAdd = ble_LR_DSA_125kb_0_37_modemConfig,
    .baseFrequency = 2402000000,
    .channelSpacing = 2000000,
    .physicalChannelOffset = 0,
    .channelNumberStart = 39,
    .channelNumberEnd = 39,
    .maxPower = 140,
    .attr = &channelConfigEntryAttr_1,
#ifdef RADIO_CONFIG_ENABLE_CONC_PHY
    .entryType = 0,
#endif
#ifdef RADIO_CONFIG_ENABLE_STACK_INFO
    .stackInfo = stackInfo_3,
#endif
    .alternatePhy = NULL,
  },
};

